In [1]:
import pandas as pd
import psycopg2
import json

In [2]:
with open('./db_config.json', 'r') as archivo:
    datos = json.load(archivo)

In [3]:
try:
    conn = psycopg2.connect(
        host = 'localhost',
        user = datos['user'],
        password = datos['password'],
        database = datos['database']
    )
    print('¡Conexion exitosa!!')
    cursor = conn.cursor()
    
except Exception as ex:
    print(ex)

¡Conexion exitosa!!

In [4]:
sql = '''
        SELECT * FROM candidates
          '''
df = pd.read_sql_query(sql, conn)

C:\Users\57313\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [5]:
print(df.head())

   id  first_name   last_name                      email application_date  \
0   1  Bernadette   Langworth        leonard91@yahoo.com       2021-02-26
1   2      Camryn    Reynolds        zelda56@hotmail.com       2021-09-09
2   3       Larue      Spinka   okey_schultz41@gmail.com       2020-04-14
3   4        Arch      Spinka     elvera_kulas@yahoo.com       2020-10-01
4   5       Larue  Altenwerth  minnie.gislason@gmail.com       2020-05-20

   country yoe  seniority                         technology  \
0   Norway   2     Intern                      Data Engineer
1   Panama  10     Intern                      Data Engineer
2  Belarus   4  Mid-Level                     Client Success
3  Eritrea  25    Trainee                          QA Manual
4  Myanmar  13  Mid-Level  Social Media Community Management

   code_challenge_score  technical_interview_score
0                     3                          3
1                     2                         10
2                    10                          9
3                     7                          1
4                     9                          7

In [6]:
print(f"El dataset tiene {df.shape[0]} filas y {df.shape[1]} columnas")

El dataset tiene 50000 filas y 11 columnas

In [7]:
print(f"Formatos de columnas: \n\n{df.dtypes}")

Formatos de columnas:

id                            int64
first_name                   object
last_name                    object
email                        object
application_date             object
country                      object
yoe                          object
seniority                    object
technology                   object
code_challenge_score          int64
technical_interview_score     int64
dtype: object

In [8]:
print(f"Numero de valores nulos: \n\n{df.isna().sum()}")

Numero de valores nulos:

id                           0
first_name                   0
last_name                    0
email                        0
application_date             0
country                      0
yoe                          0
seniority                    0
technology                   0
code_challenge_score         0
technical_interview_score    0
dtype: int64

In [9]:
df.describe(include="object")

,first_name,last_name,email,application_date,country,yoe,seniority,technology
count,50000,50000,50000,50000,50000,50000,50000,50000
unique,3007,474,49833,1646,244,31,7,24
top,Sarai,Murazik,marianne31@yahoo.com,2020-07-07,Malawi,24,Intern,Game Development
freq,33,138,3,50,242,1720,7255,3818

In [10]:
df.describe()

                 id  code_challenge_score  technical_interview_score
count  50000.000000          50000.000000               50000.000000
mean   25000.500000              4.996400                   5.003880
std    14433.901067              3.166896                   3.165082
min        1.000000              0.000000                   0.000000
25%    12500.750000              2.000000                   2.000000
50%    25000.500000              5.000000                   5.000000
75%    37500.250000              8.000000                   8.000000
max    50000.000000             10.000000                  10.000000